{
  "name": "Corrección de Errores Album USA 94",
  "branchName": "feature/correccion-errores-album",
  "userStories": [
    {
      "id": "US-001",
      "title": "Corregir error 419 Page Expired en panel admin",
      "description": "As a administrador, I want to acceder al panel de administración sin errores de sesión expirada so that puedo gestionar el contenido del álbum.",
      "acceptanceCriteria": [
        "Identificar la causa del error 419 (tokens CSRF, configuración de sesiones)",
        "Corregir la configuración de sesiones en base de datos SQLite",
        "Verificar que todas las rutas admin funcionan tras login",
        "El token CSRF se regenera correctamente en cada petición"
      ],
      "priority": 1,
      "passes": true,
      "dependsOn": [],
      "completionNotes": "Completed by agent"
    },
    {
      "id": "US-002",
      "title": "Corregir error 500 en /admin/sticker",
      "description": "As a administrador, I want to acceder a la gestión de cromos sin errores so that puedo ver y administrar todos los cromos del álbum.",
      "acceptanceCriteria": [
        "Identificar la causa del error 500 (probablemente Backpack PRO filters)",
        "Eliminar o reemplazar dependencias de Backpack PRO",
        "Implementar filtros básicos sin dependencias de pago si es necesario",
        "La página /admin/sticker carga correctamente mostrando la lista de cromos"
      ],
      "priority": 1,
      "passes": true,
      "dependsOn": [
        "US-001"
      ],
      "completionNotes": "Completed by agent"
    },
    {
      "id": "US-003",
      "title": "Corregir sticker-mapper para definir posiciones de cromos",
      "description": "As a administrador, I want to usar el sticker-mapper para definir las posiciones de los cromos so that los cromos se muestren correctamente en las páginas del álbum.",
      "acceptanceCriteria": [
        "Revisar el CSS del mapper para que la imagen de fondo se muestre correctamente",
        "Los cromos existentes se muestran en sus posiciones guardadas",
        "Se pueden ajustar las posiciones de los cromos (arrastrar o editar coordenadas)",
        "Los cambios se guardan correctamente en la base de datos"
      ],
      "priority": 2,
      "passes": true,
      "dependsOn": [
        "US-002"
      ],
      "completionNotes": "Completed by agent"
    },
    {
      "id": "US-004",
      "title": "Implementar modal de confirmación para intercambios",
      "description": "As a usuario, I want to ver un modal de confirmación antes de aceptar o rechazar un intercambio so that no hago acciones accidentales.",
      "acceptanceCriteria": [
        "Al hacer clic en Aceptar intercambio aparece modal de confirmación",
        "Al hacer clic en Rechazar intercambio aparece modal de confirmación",
        "El modal muestra los detalles del intercambio (qué cromos se intercambian)",
        "Solo se ejecuta la acción al confirmar en el modal",
        "Los botones ejecutan correctamente los métodos del backend"
      ],
      "priority": 2,
      "passes": true,
      "dependsOn": [
        "US-001"
      ],
      "completionNotes": "Completed by agent"
    },
    {
      "id": "US-005",
      "title": "Añadir efecto abanico a cromos sin pegar",
      "description": "As a usuario, I want to ver mis cromos sin pegar con efecto abanico superpuestos so that tenga una experiencia visual más atractiva similar a cartas en mano.",
      "acceptanceCriteria": [
        "Los cromos sin pegar se muestran con superposición ~40%",
        "Cada cromo tiene una ligera rotación aleatoria para efecto natural",
        "Al pasar el cursor sobre un cromo, se eleva y destaca",
        "El efecto funciona correctamente en móvil y desktop"
      ],
      "priority": 3,
      "passes": false,
      "dependsOn": []
    },
    {
      "id": "US-006",
      "title": "Añadir efecto abanico a cromos repetidos",
      "description": "As a usuario, I want to ver mis cromos repetidos con efecto abanico so that pueda visualizar cuántos duplicados tengo de forma atractiva.",
      "acceptanceCriteria": [
        "Los cromos repetidos se muestran con superposición ~40%",
        "Se indica visualmente la cantidad de repetidos",
        "El efecto es consistente con el de cromos sin pegar",
        "Se puede interactuar con los cromos para seleccionarlos para intercambio"
      ],
      "priority": 3,
      "passes": false,
      "dependsOn": [
        "US-005"
      ]
    },
    {
      "id": "US-007",
      "title": "Mostrar imagen y cantidad en página Mis Cromos",
      "description": "As a usuario, I want to ver la imagen y cantidad de cada cromo en la página Mis Cromos so that pueda gestionar mi colección fácilmente.",
      "acceptanceCriteria": [
        "Cada cromo muestra su imagen correctamente",
        "Se muestra la cantidad de unidades de cada cromo",
        "El diseño es responsive y se adapta a diferentes tamaños de pantalla",
        "Los cromos se organizan de forma clara y navegable"
      ],
      "priority": 2,
      "passes": true,
      "dependsOn": [],
      "completionNotes": "Completed by agent"
    }
  ],
  "metadata": {
    "updatedAt": "2026-01-31T18:58:06.757Z"
  }
}